irun(64): 15.10-s014: (c) Copyright 1995-2016 Cadence Design Systems, Inc.
TOOL:	irun(64)	15.10-s014: Started on Apr 09, 2018 at 16:42:41 IDT
irun
	-f scm65_tb.f
		../../verilog_modules/define.v
		scm65_tb.v
		../../verilog_modules/scm65/scm65.v
		../../verilog_modules/bitslice/bitslice.v
		../../verilog_modules/Decoder_2_4/Decoder_2_4.v
		../../verilog_modules/Decoder_3_8/Decoder_3_8.v
		../../verilog_modules/Decoder_4_16/Decoder_4_16.v
		../../verilog_modules/row_decoder/row_decoder.v
		../../verilog_modules/rwlBuff_strip/rwlBuff_strip.v
		../../verilog_modules/welltap_strip/welltap_strip.v
		../../verilog_modules/MidGap_DGWCLK/MidGap_DGWCLK.v
		../../verilog_modules/read_mux/read_mux.v
		-v /data/tsmc/65LP/dig_libs/ARM_FEONLY/arm/tsmc/cln65lp/sc12_base_rvt/r0p0/verilog/sc12_cln65lp_base_rvt.v
		-v /data/tsmc/65LP/dig_libs/ARM_FEONLY/arm/tsmc/cln65lp/sc12_base_rvt/r0p0/verilog/sc12_cln65lp_base_rvt_udp.v
	-gui
	-debug
	-sv
	-nospecify
SVSEED default: 1
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
ncsim> 
ncsim> source /opt/cadence/INCISIV/151/tools/inca/files/ncsimrc
ncsim> database -open waves -into waves.shm -default
Created default SHM database waves
ncsim> probe -create -shm tb_scm65.CLK tb_scm65.DIN tb_scm65.DOUT tb_scm65.RADDR tb_scm65.RADDR_old tb_scm65.RE tb_scm65.R_W tb_scm65.TBArray tb_scm65.WADDR tb_scm65.WE tb_scm65.correct tb_scm65.error tb_scm65.fo tb_scm65.row
Created probe 1
ncsim> reset
SVSEED default: 1
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.tb_scm65:v
ncsim> run
stop -create -name Randomize -randomize
Created stop Randomize

Simulation complete via $finish(1) at time 3010 NS + 0
./scm65_tb.v:174             $finish;			
ncsim> probe -create -shm tb_scm65.MEM.CLK tb_scm65.MEM.DGWCLKLeftNet tb_scm65.MEM.DGWClkRightNet tb_scm65.MEM.DIN tb_scm65.MEM.DOUT tb_scm65.MEM.GDINCLK tb_scm65.MEM.GRCLK tb_scm65.MEM.GWCLK tb_scm65.MEM.RADDR tb_scm65.MEM.RE tb_scm65.MEM.SE tb_scm65.MEM.WADDR tb_scm65.MEM.WE tb_scm65.MEM.decoder_read_out tb_scm65.MEM.decoder_write_out tb_scm65.MEM.rwlBuffNet_0 tb_scm65.MEM.rwlBuffNet_1 tb_scm65.MEM.rwlBuffNet_2 tb_scm65.MEM.rwlBuffNet_3
Created probe 2
ncsim> reset
SVSEED default: 1
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.tb_scm65:v
ncsim> run
Simulation complete via $finish(1) at time 3010 NS + 0
./scm65_tb.v:174             $finish;			
ncsim> probe -create -shm tb_scm65.MEM.bitslice_1.DGWCLK tb_scm65.MEM.bitslice_1.DIN tb_scm65.MEM.bitslice_1.DOUT tb_scm65.MEM.bitslice_1.GDIN tb_scm65.MEM.bitslice_1.MemoryLatch tb_scm65.MEM.bitslice_1.RWL tb_scm65.MEM.bitslice_1.clk
Created probe 3
ncsim> reset
SVSEED default: 1
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.tb_scm65:v
ncsim> run
Simulation complete via $finish(1) at time 3010 NS + 0
./scm65_tb.v:174             $finish;			
ncsim> 